#!/bin/bash
echo -e "\n===== [$(readlink -f $0)] =====\n" 1>&2
set -vxeu

################################################################################
#
# 説明
# ==========
#
# ARandRをインストールする
#
# 前提条件
# ==========
#
# - sudo可能なユーザである事
#
# パラメータ
# ==========
#
# - なし
#
# 成果物/戻り値
# ==========
#
# 成果物
# ----------
#
# - ARandRがインストールされる
#
# 戻り値
# ----------
#
# - なし
#
################################################################################

########################################
# ARandR install
########################################
readonly MY_DIR=$(readlink -f $(dirname $0))

# ARandRのインストール
sudo apt-get install -y arandr

